{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.7/4.0"
      ],
      "degree": "Master of Science",
      "department": "Electrical and Computer Engineering",
      "duration": "2017-2021",
      "school_name": "University of Saskatchewan"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AlexKirilenko",
  "highlighted_projects": [
    {
      "description": "Researched and implemented machine learning models to solve problems in the area of power systems. Examples include time series forecasting implemented using LSTM neural networks and estimation of reliability indices using regression forests.",
      "git_url": null,
      "name": "Machine Learning Models For Power Systems"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The project presents a collection of Bash and SQL scripts to automate the aggregation and persistence of hardware and real-time resource usage data from a cluster of Linux servers. The application utilizes a PostgreSQL database server deployed through the docker.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In Progress",
        "JDBC App: Programmed a DAO layer between PostgreSQL database and Java code. It allows to perform CRUD operations on retail business entities by mapping the Java objects to the relational database tables through the JDBC interface.",
        "Grep App: Developed a Java implementation of the Linux `grep` utility to recursively search for a pattern in files of a given directory. The app is implemented using Java Streams and Lambdas, allowing it to effectively process very large files using limited amount of memory. It is packaged using Maven, built into a docker image and distributed through Docker Hub."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Alex Kirilenko",
  "others": [
    {
      "bullets": [
        "Computer Science Coursera Course (Princeton University).",
        "Algorithms Coursera Course (Princeton University).",
        "Machine Learning Coursera Course (Stanford University)."
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Journal Paper: A.Kirilenko, M. Esmail, C.Y. Chung, Risk-Averse Stochastic Dynamic Line Rating Models, IEEE Transactions on Power Systems, 2020.",
        "Journal Paper: A.Kirilenko, Y. Gong, C.Y. Chung, A Framework for Power System Operational Planning under Uncertainty Using Coherent Risk Measures, IEEE Transactions on Power Systems, 2021."
      ],
      "title": "Academic Publications"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed and implemented various software projects and server-side applications following Scrum project development methodology. Gained hands-on development experience with Java, SQL and Linux, and project lifecycle management and deployment using Git, Docker and Maven.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "University of Saskatchewan",
      "description": "Collaborated with other research lab members on delegated parts of research proposals, grant applications and research project reports. Assisted as a reviewer of conference papers. Helped to organize and host of the workshops and seminars. Performed literature review and market research of various power system technologies and applications. Developed and implemented numerical and statistical models for the simulation of the impact of renewable energy on power system operation.",
      "duration": "2017-2021",
      "title": "Graduate Research Assistant"
    }
  ],
  "skills": {
    "competent": [
      "Spring Boot",
      "Hibernate",
      "REST API",
      "Docker",
      "Maven",
      "Python"
    ],
    "familiar": [
      "Networking (TCP/IP)",
      "Google Cloud Platform",
      "JavaScript",
      "HTML/CSS",
      "LaTeX"
    ],
    "proficient": [
      "Java",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Linux/Bash",
      "Git"
    ]
  },
  "summary": " I graduated with MSc in Electrical Engineering from the University of Saskatchewan. During my graduate studies I focused on scientific computing, numerical methods and applied mathematics. Recently, I have joined Jarvis as Software Developer / Data Engineer where I learn the agile software development lifecycle practices and get hands-on experience with a broad stack of backend and data engineering technologies. I strive to deliver software products of the highest quality that satisfy the client's needs, and can be easily maintained by other developers. Overall, I am excited to work on challenging projects and to contribute to their success as a part of a team. "
}
